//
//  Task.h
//  homeWork27
//
//  Created by Валерий Вергейчик on 3.07.22.
//

#ifndef Task_h
#define Task_h


#endif
/* Подписаться на отслеживание изменений в БД и обновлять экран с историей запросов после изменений БД.
 
 Присылать уведомление за 30 минут, исходя из данных почасового прогноза, о наступлении неблагоприятного условия для выбранного города.

 При обновлении погоды отменять все заранее запланированные уведомления и добавлять новое, при необходимости.

 Неблагоприятные условия:
 - дождь
 - гроза
 - снег

 */
