//
//  Task.h
//  homeWork27
//
//  Created by Валерий Вергейчик on 3.07.22.
//

#ifndef Task_h
#define Task_h


#endif
/* Сохранять в локальную базу данных историю запросов: координаты(в 2 полях отдельных), время(в секундах), текущую погоду(попробуйте сохранять в отдельную таблицу БД).
 Для текущей погоды сохранять ток примитивные типы.

 Выводить историю запросов на экран начиная от самого свежего. Дату и время выводить в читаемом формате)
 Сделать на отдельном VC. Без красиво UI, просто вывод данных

 */
